# Get  `value_counts()` from DataFrames

### Import Pandas

In [1]:
import pandas as pd

### U.S. Major League Soccer Salaries

In [2]:
salaries = pd.read_csv("mls_salaries.csv")

### Head

In [3]:
# called the head method to see what were working with
salaries.head()

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0               2297000.00
1  ATL   Ambrose      Mikey        D      65625.0                 65625.00
2  ATL      Asad      Yamil        M     150000.0                150000.00
3  ATL     Bloom       Mark        D      99225.0                106573.89
4  ATL  Carleton     Andrew        F      65000.0                 77400.00

### Return a Series column and count frequency

In [4]:
# fisrt, return a column as a Series from the DataFrame
salaries["club"]

0      ATL
1      ATL
2      ATL
3      ATL
4      ATL
      ...
610    VAN
611    VAN
612    VAN
613    NaN
614    VAN
Name: club, Length: 615, dtype: object

In [5]:
# next, return the value frequency for each value in 'club'
salaries["club"].value_counts()

VAN      32
PHI      31
ATL      31
CLB      30
ORL      30
DAL      29
SJ       29
NYCFC    28
HOU      28
NYRB     28
TOR      27
RSL      27
POR      27
MTL      27
CHI      27
MNUFC    27
LA       27
DC       27
KC       26
COL      26
SEA      25
NE       23
LAFC      2
Name: club, dtype: int64

### Original DataFrame

In [6]:
# as you can see, it does not mutate the original DataFrame
salaries["club"]

0      ATL
1      ATL
2      ATL
3      ATL
4      ATL
      ...
610    VAN
611    VAN
612    VAN
613    NaN
614    VAN
Name: club, Length: 615, dtype: object

In [7]:
# let's try one more, so hwo about salary? Surely they all make over 100k?
salaries["base_salary"].value_counts()

53004.0     44
65004.0     33
65625.0     19
65000.0     19
150000.0    15
            ..
106312.5     1
96800.0      1
850000.0     1
202000.0     1
126500.0     1
Name: base_salary, Length: 248, dtype: int64